In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser = Series(np.arange(3.))

data = DataFrame(np.arange(16).reshape(4,4),index=list('abcd'),columns=list('wxyz'))

data

    w   x   y   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [3]:
data['w']  #选择表格中的'w'列，使用类字典属性,返回的是Series类型

a     0
b     4
c     8
d    12
Name: w, dtype: int64

In [4]:
data.w  #选择表格中的'w'列，使用点属性,返回的是Series类型

a     0
b     4
c     8
d    12
Name: w, dtype: int64

In [5]:
data[['w']]  #选择表格中的'w'列，返回的是DataFrame类型

    w
a   0
b   4
c   8
d  12

In [6]:
data[['w','z']]  #选择表格中的'w'、'z'列

    w   z
a   0   3
b   4   7
c   8  11
d  12  15

In [7]:
data[0:2]  #返回第1行到第2行的所有行，前闭后开，包括前不包括后

   w  x  y  z
a  0  1  2  3
b  4  5  6  7

In [8]:
data[1:2]  #返回第2行，从0计，返回的是单行，通过有前后值的索引形式，如果采用data[1]则报错

   w  x  y  z
b  4  5  6  7

In [9]:
data.iloc[1:2]  # for positional indexing

   w  x  y  z
b  4  5  6  7

In [10]:
data.loc['a']  # for label based indexing

w    0
x    1
y    2
z    3
Name: a, dtype: int64

In [11]:
data['a':'b']  #利用index值进行切片，返回的是**前闭后闭**的DataFrame，即末端是包含的

   w  x  y  z
a  0  1  2  3
b  4  5  6  7

In [12]:
data.head()  #返回data的前几行数据，默认为前五行，需要前十行则data.head(10)

    w   x   y   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [13]:
data.tail()  #返回data的后几行数据，默认为后五行，需要后十行则data.tail(10)

    w   x   y   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [14]:
data.iloc[-1]   #选取DataFrame最后一行，返回的是Series

w    12
x    13
y    14
z    15
Name: d, dtype: int64

In [15]:
data.iloc[-1:]   #选取DataFrame最后一行，返回的是DataFrame

    w   x   y   z
d  12  13  14  15

In [16]:
data.loc['a',['w','x']]   #返回‘a’行'w'、'x'列，这种用于选取行索引列索引已知

w    0
x    1
Name: a, dtype: int64

In [17]:
data.iat[1,1]   #选取第二行第二列，用于已知行、列位置的选取

5

In [18]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [19]:
data = DataFrame(np.arange(15).reshape(3,5),index=['one','two','three'],columns=['a','b','c','d','e'])

In [20]:
data

        a   b   c   d   e
one     0   1   2   3   4
two     5   6   7   8   9
three  10  11  12  13  14

In [21]:
from pandas.io.parsers import read_csv

In [22]:
df = read_csv('./data/tencent_hr.csv')  #从CSV中读取

In [23]:
df

,work_place,work_type,work_time,work_count,work_name
0,北京,技术类,2017-12-20,1,MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1,北京,技术类,2017-12-20,1,WXG08-122 微信数据挖掘算法高级工程师（北京）
2,北京,技术类,2017-12-20,1,OMG097-测试开发工程师（北京）
3,北京,技术类,2017-12-20,2,OMG236-腾讯视频推荐算法高级工程师（北京）
4,北京,技术类,2017-12-20,1,23671-高级数据分析开发工程师(北京）
5,北京,技术类,2017-12-20,1,22090-天天快报-文本分析与挖掘高级工程师（北京）
6,北京,技术类,2017-12-20,1,WXG08-121 微信机器学习算法工程师（北京）
7,北京,技术类,2017-12-20,3,23674-腾讯新闻高级系统测试工程师
8,北京,技术类,2017-12-20,1,SA-腾讯社交广告高级系统测试工程师（北京）
9,北京,技术类,2017-12-19,2,22989-腾讯云高级后台开发工程师（北京）
10,北京,技术类,2017-12-19,2,22989-云计算研发工程师（北京）
11,北京,技术类,2017-12-19,3,22989-腾讯云高级后台开发(互联网业务)（北京）
12,北京,技术类,2017-12-19,1,OMG097-数据挖掘工程师(北京）
13,北京,技术类,2017-12-18,2,23674-搜索架构高级工程师
14,北京,产品/项目类,2017-12-18,1,22090-天天快报-数据产品组组长（北京）
15,北京,技术类,2017-12-19,3,TEG02-控制器研发工程师（北京）
16,北京,技术类,2017-12-19,1,22989-高级图像处理算法工程师（北京）
17,北京,技术类,2017-12-19,1,WXG08-121 微信模式识别自然语言处理算法工程师（北京）
18,北京,技术类,2017-12-18,2,23674-新闻搜索算法高级工程师
19,北京,技术类,2017-12-18,1,OMG097-后台开发高级工程师(北京）
20,北京,技术类,2017-12-18,1,MIG03-数据评测工程师（北京）
21,北京,技术类,2017-12-16,2,OMG097-数据挖掘工程师(北京）
22,北京,技术类,2017-12-15,3,MIG07-系统安全研究员（北京）
23,北京,技术类,2017-12-15,1,SA-腾讯社交广告联盟策略开发工程师（北京）
24,北京,技术类,2017-12-14,1,23048-内容推荐算法高级工程师（北京）
25,北京,技术类,2017-12-18,1,MIG16-地图专题数据后台开发工程师-功能方向（北京）
26,北京,技术类,2017-12-15,3,MIG07-系统安全研究员（北京）
27,北京,技术类,2017-12-15,2,MIG16-地图数据高级后台工程师（北京）
28,北京,技术类,2017-12-14,1,TEG05-高级安全数据研究员(北京）
29,北京,技术类,2017-12-14,2,SA-腾讯社交广告算法工程师（质量研发中心 北京）
...,...,...,...,...,...
52,北京,技术类,2017-11-27,1,MIG16-地图导航后台开发工程师(北京)
53,北京,技术类,2017-11-26,1,23048-翻译君后台开发高级工程师（北京）
54,北京,技术类,2017-11-21,2,TEG03-高级算法研发工程师（深圳）
55,北京,技术类,2017-12-01,1,22989-云存储资深研发工程师（北京）
56,北京,技术类,2017-12-01,1,MIG15-自然语言处理高级算法研究员
57,北京,技术类,2017-11-26,1,SA-腾讯社交广告定向系统开发工程师（北京）
58,北京,技术类,2017-11-22,2,OMG236-腾讯视频自然语言处理高级工程师（北京）
59,北京,技术类,2017-11-21,1,17757-高级数据挖掘工程师（北京）
60,北京,技术类,2017-11-21,3,MIG16-地图导航惯导开发工程师（北京）
61,北京,技术类,2017-11-13,1,TEG17-AI LAB语音识别研发工程师(深圳）
62,北京,技术类,2017-11-08,1,MIG16-地图众包业务后台开发高级工程师（北京）
63,北京,技术类,2017-11-06,2,MIG16-自动驾驶数据平台大数据高级系统架构师(北京)
64,北京,技术类,2017-11-03,1,MIG16-地图POI数据挖掘高级研发工程师（北京）
65,北京,技术类,2017-11-16,1,SNG02-腾讯云汽车行业方案架构师（北京/上海/深圳）
66,北京,技术类,2017-11-08,1,23674-腾讯新闻后台测试组长
67,北京,技术类,2017-11-06,0,MIG16-自动驾驶数据平台高级后台开发工程师(北京)
68,北京,技术类,2017-11-03,1,MIG16-地图POI数据自然语言处理工程师（北京）
69,北京,技术类,2017-11-02,1,MIG16-地图后台高级研发工程师-融合方向（北京）
70,北京,技术类,2017-11-01,3,MIG16-AI算法研究（北京）
71,北京,技术类,2017-11-01,1,MIG16-基础架构工程师（北京）
72,北京,技术类,2017-10-30,2,MIG16-腾讯地图导航/步行骑行/公交后台开发工程师(北京)
73,北京,技术类,2017-10-26,1,MIG16-自动驾驶融合感知(北京)
74,北京,技术类,2017-10-26,1,MIG16-自动驾驶融合定位(北京)
75,北京,技术类,2017-11-01,2,MIG16-运营后台开发工程师（北京）
76,北京,技术类,2017-11-01,1,MIG16-地图大数据挖掘工程师（北京）
77,北京,技术类,2017-10-30,1,22090-天天快报-图像算法工程师（北京）
78,北京,技术类,2017-10-26,1,MIG16-自动驾驶深度学习(北京)
79,北京,技术类,2017-10-25,1,MIG16-计算机视觉高级算法工程师（北京）
80,北京,技术类,2017-09-27,1,23048-翻译君语料数据工程师（北京）
81,北京,技术类,2017-09-27,2,SA-腾讯社交广告测试开发工程师（北京）

In [24]:
df.shape  #数据结构的形状

(82, 5)

In [25]:
df.columns

Index(['work_place', 'work_type', 'work_time', 'work_count', 'work_name'], dtype='object')

In [26]:
df.dtypes

work_place    object
work_type     object
work_time     object
work_count     int64
work_name     object
dtype: object

In [27]:
df.index

RangeIndex(start=0, stop=82, step=1)

In [28]:
df.values

array([['北京', '技术类', '2017-12-20', 1, 'MIG16-位置大数据机器学习/深度学习算法研究员（北京）'],
       ['北京', '技术类', '2017-12-20', 1, 'WXG08-122 微信数据挖掘算法高级工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 1, 'OMG097-测试开发工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 2, 'OMG236-腾讯视频推荐算法高级工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 1, '23671-高级数据分析开发工程师(北京）'],
       ['北京', '技术类', '2017-12-20', 1, '22090-天天快报-文本分析与挖掘高级工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 1, 'WXG08-121 微信机器学习算法工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 3, '23674-腾讯新闻高级系统测试工程师'],
       ['北京', '技术类', '2017-12-20', 1, 'SA-腾讯社交广告高级系统测试工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 2, '22989-腾讯云高级后台开发工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 2, '22989-云计算研发工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 3, '22989-腾讯云高级后台开发(互联网业务)（北京）'],
       ['北京', '技术类', '2017-12-19', 1, 'OMG097-数据挖掘工程师(北京）'],
       ['北京', '技术类', '2017-12-18', 2, '23674-搜索架构高级工程师'],
       ['北京', '产品/项目类', '2017-12-18', 1, '22090-天天快报-数据产品组组长（北京）'],
       ['北京', '技术类', '2017-12-19', 3, 'TEG02-控制器研发工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 1, '22989-高级图像处理算法工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 1, 'WXG08-121 微信模式识别自然语言处理算法工程师（北京）'],
       ['北京', '技术类', '2017-12-18', 2, '23674-新闻搜索算法高级工程师'],
       ['北京', '技术类', '2017-12-18', 1, 'OMG097-后台开发高级工程师(北京）'],
       ['北京', '技术类', '2017-12-18', 1, 'MIG03-数据评测工程师（北京）'],
       ['北京', '技术类', '2017-12-16', 2, 'OMG097-数据挖掘工程师(北京）'],
       ['北京', '技术类', '2017-12-15', 3, 'MIG07-系统安全研究员（北京）'],
       ['北京', '技术类', '2017-12-15', 1, 'SA-腾讯社交广告联盟策略开发工程师（北京）'],
       ['北京', '技术类', '2017-12-14', 1, '23048-内容推荐算法高级工程师（北京）'],
       ['北京', '技术类', '2017-12-18', 1, 'MIG16-地图专题数据后台开发工程师-功能方向（北京）'],
       ['北京', '技术类', '2017-12-15', 3, 'MIG07-系统安全研究员（北京）'],
       ['北京', '技术类', '2017-12-15', 2, 'MIG16-地图数据高级后台工程师（北京）'],
       ['北京', '技术类', '2017-12-14', 1, 'TEG05-高级安全数据研究员(北京）'],
       ['北京', '技术类', '2017-12-14', 2, 'SA-腾讯社交广告算法工程师（质量研发中心 北京）'],
       ['北京', '技术类', '2017-12-13', 2, '22989-腾讯云大客户售后高级顾问（北京）'],
       ['北京', '技术类', '2017-12-13', 2, '22989-腾讯云行业架构师（北京）'],
       ['北京', '技术类', '2017-12-12', 1, 'WXG02-116 测试开发工程师'],
       ['北京', '技术类', '2017-12-11', 1, '15503-系统漏洞研究工程师（北京）'],
       ['北京', '产品/项目类', '2017-12-07', 1, '22989-腾讯云AI行业方案专家（北京）'],
       ['北京', '技术类', '2017-12-13', 2, '23674-腾讯新闻大数据分析工程师'],
       ['北京', '技术类', '2017-12-13', 1, 'MIG16-腾讯地图自然语言处理高级工程师(北京)'],
       ['北京', '技术类', '2017-12-12', 1, 'OMG236-腾讯视频搜索数据模型高级工程师(北京)'],
       ['北京', '技术类', '2017-12-11', 1, '23671-数据开发工程师（北京）'],
       ['北京', '技术类', '2017-12-06', 1, '22989-腾讯云PAAS产品中心高级后端开发（北京）'],
       ['北京', '技术类', '2017-12-06', 1, 'WXG08-121 模式识别机器学习（高级）算法工程师（北京）'],
       ['北京', '技术类', '2017-12-05', 1, 'MIG07-企业安全运营工程师（北京）'],
       ['北京', '技术类', '2017-12-05', 0, 'OMG097-业务运维（北京）'],
       ['北京', '技术类', '2017-12-04', 2, 'TEG11-机器翻译语料挖掘工程师（北京）'],
       ['北京', '技术类', '2017-12-04', 1, 'TEG13-图像OCR算法工程师(北京)'],
       ['北京', '技术类', '2017-12-06', 1, 'WXG08-121 模式识别自然语言处理（高级）算法工程师（北京）'],
       ['北京', '技术类', '2017-12-05', 4, 'SNG02-自然语言处理高级研发工程师（北京）'],
       ['北京', '技术类', '2017-12-04', 1, 'WXG08-113 微信搜索后台开发高级工程师（北京）'],
       ['北京', '技术类', '2017-12-04', 2, '22086-数据挖掘工程师(北京）'],
       ['北京', '技术类', '2017-12-02', 1, 'MIG03-腾讯地图高级算法评测工程师（北京）'],
       ['北京', '技术类', '2017-12-01', 1, '22989-C++后台开发工程师（北京）'],
       ['北京', '技术类', '2017-12-01', 1, '22989-分布式存储高级研发工程师（北京）'],
       ['北京', '技术类', '2017-11-27', 1, 'MIG16-地图导航后台开发工程师(北京)'],
       ['北京', '技术类', '2017-11-26', 1, '23048-翻译君后台开发高级工程师（北京）'],
       ['北京', '技术类', '2017-11-21', 2, 'TEG03-高级算法研发工程师（深圳）'],
       ['北京', '技术类', '2017-12-01', 1, '22989-云存储资深研发工程师（北京）'],
       ['北京', '技术类', '2017-12-01', 1, 'MIG15-自然语言处理高级算法研究员'],
       ['北京', '技术类', '2017-11-26', 1, 'SA-腾讯社交广告定向系统开发工程师（北京）'],
       ['北京', '技术类', '2017-11-22', 2, 'OMG236-腾讯视频自然语言处理高级工程师（北京）'],
       ['北京', '技术类', '2017-11-21', 1, '17757-高级数据挖掘工程师（北京）'],
       ['北京', '技术类', '2017-11-21', 3, 'MIG16-地图导航惯导开发工程师（北京）'],
       ['北京', '技术类', '2017-11-13', 1, 'TEG17-AI LAB语音识别研发工程师(深圳）'],
       ['北京', '技术类', '2017-11-08', 1, 'MIG16-地图众包业务后台开发高级工程师（北京）'],
       ['北京', '技术类', '2017-11-06', 2, 'MIG16-自动驾驶数据平台大数据高级系统架构师(北京)'],
       ['北京', '技术类', '2017-11-03', 1, 'MIG16-地图POI数据挖掘高级研发工程师（北京）'],
       ['北京', '技术类', '2017-11-16', 1, 'SNG02-腾讯云汽车行业方案架构师（北京/上海/深圳）'],
       ['北京', '技术类', '2017-11-08', 1, '23674-腾讯新闻后台测试组长'],
       ['北京', '技术类', '2017-11-06', 0, 'MIG16-自动驾驶数据平台高级后台开发工程师(北京)'],
       ['北京', '技术类', '2017-11-03', 1, 'MIG16-地图POI数据自然语言处理工程师（北京）'],
       ['北京', '技术类', '2017-11-02', 1, 'MIG16-地图后台高级研发工程师-融合方向（北京）'],
       ['北京', '技术类', '2017-11-01', 3, 'MIG16-AI算法研究（北京）'],
       ['北京', '技术类', '2017-11-01', 1, 'MIG16-基础架构工程师（北京）'],
       ['北京', '技术类', '2017-10-30', 2, 'MIG16-腾讯地图导航/步行骑行/公交后台开发工程师(北京)'],
       ['北京', '技术类', '2017-10-26', 1, 'MIG16-自动驾驶融合感知(北京)'],
       ['北京', '技术类', '2017-10-26', 1, 'MIG16-自动驾驶融合定位(北京)'],
       ['北京', '技术类', '2017-11-01', 2, 'MIG16-运营后台开发工程师（北京）'],
       ['北京', '技术类', '2017-11-01', 1, 'MIG16-地图大数据挖掘工程师（北京）'],
       ['北京', '技术类', '2017-10-30', 1, '22090-天天快报-图像算法工程师（北京）'],
       ['北京', '技术类', '2017-10-26', 1, 'MIG16-自动驾驶深度学习(北京)'],
       ['北京', '技术类', '2017-10-25', 1, 'MIG16-计算机视觉高级算法工程师（北京）'],
       ['北京', '技术类', '2017-09-27', 1, '23048-翻译君语料数据工程师（北京）'],
       ['北京', '技术类', '2017-09-27', 2, 'SA-腾讯社交广告测试开发工程师（北京）']], dtype=object)

In [29]:
col = df[df.columns[4]]  #选中DataFrame一列，则为Series型数据
col

0       MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1         WXG08-122 微信数据挖掘算法高级工程师（北京）
2                  OMG097-测试开发工程师（北京）
3            OMG236-腾讯视频推荐算法高级工程师（北京）
4               23671-高级数据分析开发工程师(北京）
5         22090-天天快报-文本分析与挖掘高级工程师（北京）
6           WXG08-121 微信机器学习算法工程师（北京）
7                 23674-腾讯新闻高级系统测试工程师
8              SA-腾讯社交广告高级系统测试工程师（北京）
9              22989-腾讯云高级后台开发工程师（北京）
10                 22989-云计算研发工程师（北京）
11         22989-腾讯云高级后台开发(互联网业务)（北京）
12                 OMG097-数据挖掘工程师(北京）
13                    23674-搜索架构高级工程师
14             22090-天天快报-数据产品组组长（北京）
15                 TEG02-控制器研发工程师（北京）
16              22989-高级图像处理算法工程师（北京）
17    WXG08-121 微信模式识别自然语言处理算法工程师（北京）
18                  23674-新闻搜索算法高级工程师
19               OMG097-后台开发高级工程师(北京）
20                  MIG03-数据评测工程师（北京）
21                 OMG097-数据挖掘工程师(北京）
22                  MIG07-系统安全研究员（北京）
23             SA-腾讯社交广告联盟策略开发工程师（北京）
24              23048-内容推荐算法高级工程师（北京）
25       MIG16-地图专题数据后台开发工程师-功能方向（北京）
26                  MIG07-系统安全研究员（北京）
27              MIG16-地图数据高级后台工程师（北京）
28                TEG05-高级安全数据研究员(北京）
29          SA-腾讯社交广告算法工程师（质量研发中心 北京）
                   ...
52              MIG16-地图导航后台开发工程师(北京)
53             23048-翻译君后台开发高级工程师（北京）
54                TEG03-高级算法研发工程师（深圳）
55               22989-云存储资深研发工程师（北京）
56                MIG15-自然语言处理高级算法研究员
57             SA-腾讯社交广告定向系统开发工程师（北京）
58         OMG236-腾讯视频自然语言处理高级工程师（北京）
59                17757-高级数据挖掘工程师（北京）
60              MIG16-地图导航惯导开发工程师（北京）
61          TEG17-AI LAB语音识别研发工程师(深圳）
62          MIG16-地图众包业务后台开发高级工程师（北京）
63       MIG16-自动驾驶数据平台大数据高级系统架构师(北京)
64         MIG16-地图POI数据挖掘高级研发工程师（北京）
65       SNG02-腾讯云汽车行业方案架构师（北京/上海/深圳）
66                   23674-腾讯新闻后台测试组长
67        MIG16-自动驾驶数据平台高级后台开发工程师(北京)
68         MIG16-地图POI数据自然语言处理工程师（北京）
69         MIG16-地图后台高级研发工程师-融合方向（北京）
70                   MIG16-AI算法研究（北京）
71                  MIG16-基础架构工程师（北京）
72    MIG16-腾讯地图导航/步行骑行/公交后台开发工程师(北京)
73                 MIG16-自动驾驶融合感知(北京)
74                 MIG16-自动驾驶融合定位(北京)
75                MIG16-运营后台开发工程师（北京）
76               MIG16-地图大数据挖掘工程师（北京）
77             22090-天天快报-图像算法工程师（北京）
78                 MIG16-自动驾驶深度学习(北京)
79             MIG16-计算机视觉高级算法工程师（北京）
80               23048-翻译君语料数据工程师（北京）
81               SA-腾讯社交广告测试开发工程师（北京）
Name: work_name, Length: 82, dtype: object

In [30]:
col.shape  #输出每维的长度，numpy的函数同样适用于pandas

(82,)

In [31]:
col[1:6]

1    WXG08-122 微信数据挖掘算法高级工程师（北京）
2             OMG097-测试开发工程师（北京）
3       OMG236-腾讯视频推荐算法高级工程师（北京）
4          23671-高级数据分析开发工程师(北京）
5    22090-天天快报-文本分析与挖掘高级工程师（北京）
Name: work_name, dtype: object

In [32]:
import numpy as np
import pandas as pd


data = {'Weather': ['cold', 'hot', 'cold', 'hot',
   'cold', 'hot', 'cold'],
   'Food' : ['soup', 'soup', 'icecream', 'chocolate',
   'icecream', 'icecream', 'soup'],
   'Price' : 10 * np.random.rand(7), 'Number' : np.random.randint(1, 9 + 1, size=(7,))}
df = pd.DataFrame(data)

In [33]:
weather_group = df.groupby('Weather')  #数据聚合，按weather分组
i = 0
for name, group in weather_group:  #name为weather的名字，group为该类中的项
    i += 1
    print(i, name)
    print(group)

1 cold
       Food  Number     Price Weather
0      soup       8  7.163585    cold
2  icecream       8  4.663224    cold
4  icecream       3  0.844458    cold
6      soup       1  3.609494    cold
2 hot
        Food  Number     Price Weather
1       soup       3  8.618860     hot
3  chocolate       7  5.734819     hot
5   icecream       9  5.558212     hot

In [34]:
weather_group.first()

         Food  Number     Price
Weather
cold     soup       8  7.163585
hot      soup       3  8.618860

In [35]:
weather_group.last()

             Food  Number     Price
Weather
cold         soup       1  3.609494
hot      icecream       9  5.558212

In [36]:
weather_group.mean()

           Number     Price
Weather
cold     5.000000  4.070190
hot      6.333333  6.637297

In [37]:
wf_group = df.groupby(['Weather', 'Food'])
for name, group in wf_group:
    print(name)
    print(group)

('cold', 'icecream')
       Food  Number     Price Weather
2  icecream       8  4.663224    cold
4  icecream       3  0.844458    cold
('cold', 'soup')
   Food  Number     Price Weather
0  soup       8  7.163585    cold
6  soup       1  3.609494    cold
('hot', 'chocolate')
        Food  Number     Price Weather
3  chocolate       7  5.734819     hot
('hot', 'icecream')
       Food  Number     Price Weather
5  icecream       9  5.558212     hot
('hot', 'soup')
   Food  Number    Price Weather
1  soup       3  8.61886     hot

In [38]:
print(wf_group.agg([np.mean, np.median]))  # 通过agg()可以对数据组施加一系列的NumPy函数

                  Number            Price
                    mean median      mean    median
Weather Food
cold    icecream     5.5    5.5  2.753841  2.753841
        soup         4.5    4.5  5.386539  5.386539
hot     chocolate    7.0    7.0  5.734819  5.734819
        icecream     9.0    9.0  5.558212  5.558212
        soup         3.0    3.0  8.618860  8.618860

In [39]:
print(pd.concat([df[:3],df[3:]]))  #串联
print(df[:3].append(df[5:]))  #串联

        Food  Number     Price Weather
0       soup       8  7.163585    cold
1       soup       3  8.618860     hot
2   icecream       8  4.663224    cold
3  chocolate       7  5.734819     hot
4   icecream       3  0.844458    cold
5   icecream       9  5.558212     hot
6       soup       1  3.609494    cold
       Food  Number     Price Weather
0      soup       8  7.163585    cold
1      soup       3  8.618860     hot
2  icecream       8  4.663224    cold
5  icecream       9  5.558212     hot
6      soup       1  3.609494    cold

In [40]:
import numpy as np
import pandas as pd


print(pd.date_range('1/1/2018',periods=30,freq='D'))  #生成时间列表，周期为42天，D
print(pd.to_datetime(['20181231','1/1/2017']))  #将字符串转化为日期数据

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10', '2018-01-11', '2018-01-12',
               '2018-01-13', '2018-01-14', '2018-01-15', '2018-01-16',
               '2018-01-17', '2018-01-18', '2018-01-19', '2018-01-20',
               '2018-01-21', '2018-01-22', '2018-01-23', '2018-01-24',
               '2018-01-25', '2018-01-26', '2018-01-27', '2018-01-28',
               '2018-01-29', '2018-01-30'],
              dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2018-12-31', '2017-01-01'], dtype='datetime64[ns]', freq=None)

In [41]:
import numpy as np
import pandas as pd


data = {'Weather' : ['cold', 'hot', 'cold', 'hot',
   'cold', 'hot', 'cold'],
   'Food' : ['soup', 'soup', 'icecream', 'chocolate',
   'icecream', 'icecream', 'soup'],
   'Price' : 10 * np.random.rand(7), 'Number' : np.random.randint(1, 9 + 1, size=(7,))}
df = pd.DataFrame(data)   #根据字典创建DataFrame
print(pd.pivot_table(df,columns=['Food'],aggfunc=np.max))   #np.max不能加括号
print(pd.pivot_table(df,columns=['Food'],aggfunc=np.sum))   #np.sum不能加括号

Food    chocolate icecream     soup
Number          8        9        7
Price     1.83015  9.60307  2.45061
Weather       hot      hot      hot
Food    chocolate   icecream       soup
Number   8.000000  16.000000  15.000000
Price    1.830152  25.487696   4.353363

## Sorting and Ranking （排序）

按row或column index来排序的话，可以用sort_index方法，会返回一个新的object：

In [42]:
import numpy as np
import pandas as pd

In [43]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [44]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

在DataFrame，可以用index或其他axis来排序：

In [45]:
df = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [46]:
df.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [47]:
df.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

默认是升序，可以设置降序：

In [48]:
df.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

通过值来排序，用sort_values方法：

In [49]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

缺失值会被排在最后：

In [50]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

对于一个DataFrame，可以用一列或多列作为sort keys。这样的话，只需要把一列或多列的名字导入到sort_values即可：

In [51]:
df = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
df

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [52]:
df.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

多列排序的话，传入一个list of names：

In [53]:
df.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

ranking（排名）是给有效的数据分配数字。rank方法能用于series和DataFrame，rank方法默认会给每个group一个mean rank（平均排名）。rank 表示在这个数在原来的Series中排第几名，有相同的数，取其排名平均（默认）作为值：

In [54]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [55]:
obj.sort_values()

1   -5
5    0
4    2
3    4
6    4
0    7
2    7
dtype: int64

In [56]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

在obj中，4和4的排名是第4名和第五名，取平均得4.5。7和7的排名分别是第六名和第七名，则其排名取平均得6.5。

rank也可以根据数据被观测到的顺序来设定：

In [57]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

这里没有给0和2(指两个数字7)赋予average rank 6.5，而是给第一个看到的7（label 0）设置rank为6，第二个看到的7（label 2）设置rank为7。

也可以设置降序：

In [58]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

DataFrame 可以根据行或列来计算rank：

In [59]:
df = pd.DataFrame({'b': [4.3, 7, -3, 2],
                      'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
df

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [60]:
df.rank(axis='columns') # columns表示列与列之间的排序（即每一行里数据间的排序）

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

## Reading Text Files in Pieces（读取一部分文本）

对于一些比较大的文件，我们想要一次读取一小部分，或者每次迭代一小部分。在我们看一个比较大的文件前，先设置一下pandas中显示的数量：

In [61]:
import numpy as np
import pandas as pd

In [62]:
result = pd.read_csv('./data/tencent_hr.csv')
result

,work_place,work_type,work_time,work_count,work_name
0,北京,技术类,2017-12-20,1,MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1,北京,技术类,2017-12-20,1,WXG08-122 微信数据挖掘算法高级工程师（北京）
2,北京,技术类,2017-12-20,1,OMG097-测试开发工程师（北京）
3,北京,技术类,2017-12-20,2,OMG236-腾讯视频推荐算法高级工程师（北京）
4,北京,技术类,2017-12-20,1,23671-高级数据分析开发工程师(北京）
5,北京,技术类,2017-12-20,1,22090-天天快报-文本分析与挖掘高级工程师（北京）
6,北京,技术类,2017-12-20,1,WXG08-121 微信机器学习算法工程师（北京）
7,北京,技术类,2017-12-20,3,23674-腾讯新闻高级系统测试工程师
8,北京,技术类,2017-12-20,1,SA-腾讯社交广告高级系统测试工程师（北京）
9,北京,技术类,2017-12-19,2,22989-腾讯云高级后台开发工程师（北京）
10,北京,技术类,2017-12-19,2,22989-云计算研发工程师（北京）
11,北京,技术类,2017-12-19,3,22989-腾讯云高级后台开发(互联网业务)（北京）
12,北京,技术类,2017-12-19,1,OMG097-数据挖掘工程师(北京）
13,北京,技术类,2017-12-18,2,23674-搜索架构高级工程师
14,北京,产品/项目类,2017-12-18,1,22090-天天快报-数据产品组组长（北京）
15,北京,技术类,2017-12-19,3,TEG02-控制器研发工程师（北京）
16,北京,技术类,2017-12-19,1,22989-高级图像处理算法工程师（北京）
17,北京,技术类,2017-12-19,1,WXG08-121 微信模式识别自然语言处理算法工程师（北京）
18,北京,技术类,2017-12-18,2,23674-新闻搜索算法高级工程师
19,北京,技术类,2017-12-18,1,OMG097-后台开发高级工程师(北京）
20,北京,技术类,2017-12-18,1,MIG03-数据评测工程师（北京）
21,北京,技术类,2017-12-16,2,OMG097-数据挖掘工程师(北京）
22,北京,技术类,2017-12-15,3,MIG07-系统安全研究员（北京）
23,北京,技术类,2017-12-15,1,SA-腾讯社交广告联盟策略开发工程师（北京）
24,北京,技术类,2017-12-14,1,23048-内容推荐算法高级工程师（北京）
25,北京,技术类,2017-12-18,1,MIG16-地图专题数据后台开发工程师-功能方向（北京）
26,北京,技术类,2017-12-15,3,MIG07-系统安全研究员（北京）
27,北京,技术类,2017-12-15,2,MIG16-地图数据高级后台工程师（北京）
28,北京,技术类,2017-12-14,1,TEG05-高级安全数据研究员(北京）
29,北京,技术类,2017-12-14,2,SA-腾讯社交广告算法工程师（质量研发中心 北京）
...,...,...,...,...,...
52,北京,技术类,2017-11-27,1,MIG16-地图导航后台开发工程师(北京)
53,北京,技术类,2017-11-26,1,23048-翻译君后台开发高级工程师（北京）
54,北京,技术类,2017-11-21,2,TEG03-高级算法研发工程师（深圳）
55,北京,技术类,2017-12-01,1,22989-云存储资深研发工程师（北京）
56,北京,技术类,2017-12-01,1,MIG15-自然语言处理高级算法研究员
57,北京,技术类,2017-11-26,1,SA-腾讯社交广告定向系统开发工程师（北京）
58,北京,技术类,2017-11-22,2,OMG236-腾讯视频自然语言处理高级工程师（北京）
59,北京,技术类,2017-11-21,1,17757-高级数据挖掘工程师（北京）
60,北京,技术类,2017-11-21,3,MIG16-地图导航惯导开发工程师（北京）
61,北京,技术类,2017-11-13,1,TEG17-AI LAB语音识别研发工程师(深圳）
62,北京,技术类,2017-11-08,1,MIG16-地图众包业务后台开发高级工程师（北京）
63,北京,技术类,2017-11-06,2,MIG16-自动驾驶数据平台大数据高级系统架构师(北京)
64,北京,技术类,2017-11-03,1,MIG16-地图POI数据挖掘高级研发工程师（北京）
65,北京,技术类,2017-11-16,1,SNG02-腾讯云汽车行业方案架构师（北京/上海/深圳）
66,北京,技术类,2017-11-08,1,23674-腾讯新闻后台测试组长
67,北京,技术类,2017-11-06,0,MIG16-自动驾驶数据平台高级后台开发工程师(北京)
68,北京,技术类,2017-11-03,1,MIG16-地图POI数据自然语言处理工程师（北京）
69,北京,技术类,2017-11-02,1,MIG16-地图后台高级研发工程师-融合方向（北京）
70,北京,技术类,2017-11-01,3,MIG16-AI算法研究（北京）
71,北京,技术类,2017-11-01,1,MIG16-基础架构工程师（北京）
72,北京,技术类,2017-10-30,2,MIG16-腾讯地图导航/步行骑行/公交后台开发工程师(北京)
73,北京,技术类,2017-10-26,1,MIG16-自动驾驶融合感知(北京)
74,北京,技术类,2017-10-26,1,MIG16-自动驾驶融合定位(北京)
75,北京,技术类,2017-11-01,2,MIG16-运营后台开发工程师（北京）
76,北京,技术类,2017-11-01,1,MIG16-地图大数据挖掘工程师（北京）
77,北京,技术类,2017-10-30,1,22090-天天快报-图像算法工程师（北京）
78,北京,技术类,2017-10-26,1,MIG16-自动驾驶深度学习(北京)
79,北京,技术类,2017-10-25,1,MIG16-计算机视觉高级算法工程师（北京）
80,北京,技术类,2017-09-27,1,23048-翻译君语料数据工程师（北京）
81,北京,技术类,2017-09-27,2,SA-腾讯社交广告测试开发工程师（北京）

In [63]:
pd.options.display.max_rows = 10

In [64]:
result

   work_place work_type   work_time  work_count                      work_name
0          北京       技术类  2017-12-20           1  MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1          北京       技术类  2017-12-20           1    WXG08-122 微信数据挖掘算法高级工程师（北京）
2          北京       技术类  2017-12-20           1             OMG097-测试开发工程师（北京）
3          北京       技术类  2017-12-20           2       OMG236-腾讯视频推荐算法高级工程师（北京）
4          北京       技术类  2017-12-20           1          23671-高级数据分析开发工程师(北京）
..        ...       ...         ...         ...                            ...
77         北京       技术类  2017-10-30           1         22090-天天快报-图像算法工程师（北京）
78         北京       技术类  2017-10-26           1             MIG16-自动驾驶深度学习(北京)
79         北京       技术类  2017-10-25           1         MIG16-计算机视觉高级算法工程师（北京）
80         北京       技术类  2017-09-27           1           23048-翻译君语料数据工程师（北京）
81         北京       技术类  2017-09-27           2           SA-腾讯社交广告测试开发工程师（北京）

[82 rows x 5 columns]

如果只是想要读取前几行（不读取整个文件），指定一下nrows：

In [65]:
pd.read_csv('./data/tencent_hr.csv', nrows=5)

  work_place work_type   work_time  work_count                      work_name
0         北京       技术类  2017-12-20           1  MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1         北京       技术类  2017-12-20           1    WXG08-122 微信数据挖掘算法高级工程师（北京）
2         北京       技术类  2017-12-20           1             OMG097-测试开发工程师（北京）
3         北京       技术类  2017-12-20           2       OMG236-腾讯视频推荐算法高级工程师（北京）
4         北京       技术类  2017-12-20           1          23671-高级数据分析开发工程师(北京）

读取文件的一部分，可以指定chunksize：

In [66]:
chunker = pd.read_csv('./data/tencent_hr.csv', chunksize=1000)
chunker

pandas返回的TextParser object能让我们根据chunksize每次迭代文件的一部分。
TextParser有一个get_chunk方法，能返回任意大小的数据片段：

In [67]:
chunker.get_chunk(10)

  work_place work_type   work_time  work_count                      work_name
0         北京       技术类  2017-12-20           1  MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1         北京       技术类  2017-12-20           1    WXG08-122 微信数据挖掘算法高级工程师（北京）
2         北京       技术类  2017-12-20           1             OMG097-测试开发工程师（北京）
3         北京       技术类  2017-12-20           2       OMG236-腾讯视频推荐算法高级工程师（北京）
4         北京       技术类  2017-12-20           1          23671-高级数据分析开发工程师(北京）
5         北京       技术类  2017-12-20           1    22090-天天快报-文本分析与挖掘高级工程师（北京）
6         北京       技术类  2017-12-20           1      WXG08-121 微信机器学习算法工程师（北京）
7         北京       技术类  2017-12-20           3            23674-腾讯新闻高级系统测试工程师
8         北京       技术类  2017-12-20           1         SA-腾讯社交广告高级系统测试工程师（北京）
9         北京       技术类  2017-12-19           2         22989-腾讯云高级后台开发工程师（北京）

## Handling Missing Data

In [68]:
import pandas as pd
import numpy as np

In [69]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [70]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [71]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [72]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

对于DataFrame，会复杂一些。你可能想要删除包含有NA的row和column。dropna默认会删除包含有缺失值的row：

In [73]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [74]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

设定how=all只会删除那些全是NA的行：

In [75]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [76]:
data[3] = np.nan
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [77]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [78]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  1.144930 -0.012818 -1.952279
1 -0.962322  1.693457 -1.534243
2  0.358165  2.091050  1.801781
3 -1.168952  0.076862 -0.504496
4 -0.051782  1.715858 -0.715449
5 -0.601690  0.376493 -0.014238
6  0.510946 -0.743097  0.760358

In [79]:
df.iloc[:4, 1] = np.nan
df

          0         1         2
0  1.144930       NaN -1.952279
1 -0.962322       NaN -1.534243
2  0.358165       NaN  1.801781
3 -1.168952       NaN -0.504496
4 -0.051782  1.715858 -0.715449
5 -0.601690  0.376493 -0.014238
6  0.510946 -0.743097  0.760358

In [80]:
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  1.144930       NaN       NaN
1 -0.962322       NaN       NaN
2  0.358165       NaN  1.801781
3 -1.168952       NaN -0.504496
4 -0.051782  1.715858 -0.715449
5 -0.601690  0.376493 -0.014238
6  0.510946 -0.743097  0.760358

In [81]:
df.dropna()

          0         1         2
4 -0.051782  1.715858 -0.715449
5 -0.601690  0.376493 -0.014238
6  0.510946 -0.743097  0.760358

In [82]:
df.dropna(thresh=2)  # 在一行中至少有2个非 NA 值时将其保留

          0         1         2
2  0.358165       NaN  1.801781
3 -1.168952       NaN -0.504496
4 -0.051782  1.715858 -0.715449
5 -0.601690  0.376493 -0.014238
6  0.510946 -0.743097  0.760358

不是删除缺失值，而是用一些数字填补。对于大部分目的，fillna是可以用的。调用fillna的时候设置好一个常用用来替换缺失值：

In [83]:
df.fillna(0)

          0         1         2
0  1.144930  0.000000  0.000000
1 -0.962322  0.000000  0.000000
2  0.358165  0.000000  1.801781
3 -1.168952  0.000000 -0.504496
4 -0.051782  1.715858 -0.715449
5 -0.601690  0.376493 -0.014238
6  0.510946 -0.743097  0.760358

给fillna传入一个dict，可以给不同列替换不同的值：

In [84]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.144930  0.500000  0.000000
1 -0.962322  0.500000  0.000000
2  0.358165  0.500000  1.801781
3 -1.168952  0.500000 -0.504496
4 -0.051782  1.715858 -0.715449
5 -0.601690  0.376493 -0.014238
6  0.510946 -0.743097  0.760358

fillna返回一个新对象，但你可以使用inplace来直接更改原有的数据：

In [85]:
df.fillna(0, inplace=True)
df

          0         1         2
0  1.144930  0.000000  0.000000
1 -0.962322  0.000000  0.000000
2  0.358165  0.000000  1.801781
3 -1.168952  0.000000 -0.504496
4 -0.051782  1.715858 -0.715449
5 -0.601690  0.376493 -0.014238
6  0.510946 -0.743097  0.760358

## Data Transformation（数据变换）

In [86]:
import pandas as pd
import numpy as np

In [87]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

DataFrame方法duplicated返回的是一个boolean Series，表示一个row是否是重复的（根据前一行来判断）：

In [88]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

drop_duplicateds返回一个DataFrame，会删除重复的部分：

In [89]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

上面两种方法都默认考虑所有列；另外，我们可以指定一部分来检测重复值。假设我们只想检测'k1'列的重复值：

In [90]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [91]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

duplicated和drop_duplicated默认保留第一次观测到的数值组合。设置keep='last'能返回最后一个：

In [92]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [93]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

假设你想加一列，表明每种肉来源的动物是什么。我们可以写一个映射：

In [94]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

用于series的map方法接受一个函数，或是一个字典，包含着映射关系，但这里有一个小问题，有些肉是大写，有些是小写。因此，我们先用str.lower把所有的值变为小写：

In [95]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [96]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

我们也可以用一个函数解决上面的问题：

In [97]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

使用map是一个很简便的方法，用于element-wise转换和其他一些数据清洗操作。

其实fillna是一个特殊的替换操作，map可以用于修改一个object里的部分值，但是replace能提供一个更简单和更灵活的方法做到这点。

In [98]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [99]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

如果想要一次替换多个值，直接用一个list即可：

In [100]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

对于不同的值用不同的替换值，也是使用一个list：

In [101]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

参数也可以是一个dict：

In [102]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

注意：data.replace方法和data.str.replace方法是不同的，后者会对string进行element-wise替换。

In [103]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [104]:
data.index.map(lambda x: x[:4].upper())

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [105]:
data.index = data.index.map(lambda x: x[:4].upper())
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

如果你想要创建一个转换后的版本，而且不用修改原始的数据，可以用rename：

In [106]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [107]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'pekaboo'})

         one  two  pekaboo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

In [108]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

连续型数据经常被离散化或分散成bins（分箱）来分析。假设你有一组数据，你想把人分到不同的年龄组里：

In [109]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

我们把这些分到四个bin里，19~25，26~35，36~60，>60。可以用pandas里的cut：

In [110]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

返回的是一个特殊的Categorical object。我们看到的结果描述了pandas.cut如何得到bins。可以看作是一个string数组用来表示bin的名字，它内部包含了一个categories数组，用来记录不同类别的名字，并伴有表示ages的label（可以通过codes属性查看）：

In [111]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [112]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [113]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

这里pd.value_counts(cats)是pandas.cut后bin的数量。

这里我们注意一下区间。括号表示不包含，方括号表示包含。你可以自己设定哪一边关闭（right=False）：

In [114]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

你也可以用一个list或数组给labels选项来设定bin的名字：

In [115]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [116]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

如果你只是给一个bins的数量来cut，而不是自己设定每个bind的范围，cut会根据最大值和最小值来计算等长的bins。比如下面我们想要做一个均匀分布的四个bins：

In [117]:
data = np.random.rand(20)
data

array([ 0.97940367,  0.84407258,  0.08880413,  0.04744526,  0.31283515,
        0.1795502 ,  0.85614336,  0.61264393,  0.9854549 ,  0.51966704,
        0.79884719,  0.36231993,  0.2642077 ,  0.48231695,  0.74401007,
        0.60371168,  0.9771771 ,  0.84713547,  0.84093815,  0.10552663])

In [118]:
pd.cut(data, 4, precision=2)

[(0.75, 0.99], (0.75, 0.99], (0.047, 0.28], (0.047, 0.28], (0.28, 0.52], ..., (0.52, 0.75], (0.75, 0.99], (0.75, 0.99], (0.75, 0.99], (0.047, 0.28]]
Length: 20
Categories (4, interval[float64]): [(0.047, 0.28] < (0.28, 0.52] < (0.52, 0.75] < (0.75, 0.99]]

precision=2选项表示精确到小数点后两位。

一个近似的函数，qcut，会按照数据的分位数来分箱。取决于数据的分布，用cut通常不能保证每一个bin有一个相同数量的数据点。而qcut是按百分比来切的，所以可以得到等数量的bins：

In [119]:
data = np.random.randn(1000) # Normally distributed

In [120]:
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(-3.494, -0.705], (-0.705, 0.046], (0.046, 0.692], (-3.494, -0.705], (0.046, 0.692], ..., (0.046, 0.692], (0.692, 3.534], (0.692, 3.534], (0.692, 3.534], (0.692, 3.534]]
Length: 1000
Categories (4, interval[float64]): [(-3.494, -0.705] < (-0.705, 0.046] < (0.046, 0.692] < (0.692, 3.534]]

In [121]:
pd.value_counts(cats)

(0.692, 3.534]      250
(0.046, 0.692]      250
(-0.705, 0.046]     250
(-3.494, -0.705]    250
dtype: int64

类似的，在cut中我们可以自己指定百分比：

In [122]:
cats2 = pd.cut(data, [0, 0.1, 0.5, 0.9, 1.]) # 累计的百分比
cats2

[NaN, NaN, (0.1, 0.5], NaN, (0.1, 0.5], ..., (0.1, 0.5], NaN, NaN, NaN, NaN]
Length: 1000
Categories (4, interval[float64]): [(0.0, 0.1] < (0.1, 0.5] < (0.5, 0.9] < (0.9, 1.0]]

In [123]:
pd.value_counts(cats2)

(0.1, 0.5]    152
(0.5, 0.9]    138
(0.0, 0.1]     31
(0.9, 1.0]     28
dtype: int64

过滤或转换异常值是数组操作的一个重头戏。

In [124]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046481     0.020398    -0.050071     0.018840
std       1.055832     1.010322     0.988865     1.018558
min      -3.536281    -3.059396    -3.482345    -3.474455
25%      -0.715554    -0.679700    -0.698483    -0.686328
50%      -0.048511     0.013910    -0.050685     0.008196
75%       0.610809     0.706482     0.662405     0.688171
max       3.707747     3.116113     3.077179     2.835191

假设我们想要找一个列中，绝对值大于3的数字：

In [125]:
col = data[2]
col.head()

0    1.424087
1   -0.421010
2    0.358382
3   -1.231562
4   -0.778227
Name: 2, dtype: float64

In [126]:
col[np.abs(col) > 3]

121    3.077179
690   -3.122427
727   -3.482345
782   -3.042750
Name: 2, dtype: float64

选中所有绝对值大于3的行，可以用any方法在一个boolean DataFrame上：

In [127]:
data[(np.abs(data) > 3).any(1)] # any中axis=1表示column

            0         1         2         3
121  0.600892  0.126263  3.077179 -0.906762
139  3.280198  1.475179 -1.900848  0.102942
182  3.302493 -0.760766 -0.962890 -2.081171
238  1.476232  1.422226 -1.024589 -3.029243
314 -1.412162 -3.059396  0.026107  1.808384
..        ...       ...       ...       ...
580 -0.641535 -3.033023 -0.519516 -1.062270
617 -0.702007  0.471886  1.705202 -3.131631
690 -1.982425  0.973845 -3.122427  1.065147
727 -1.003728  1.453490 -3.482345  2.675523
782  0.630956 -0.556841 -3.042750 -1.219076

[15 rows x 4 columns]

下面是把绝对值大于3的数字直接变成-3或3：

In [128]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [129]:
data[98:100]

           0         1         2         3
98  0.480462  0.834191 -0.860069  0.469671
99  1.132938  0.146307 -0.894527  0.182882

In [130]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.047320     0.020374    -0.049501     0.019475
std       1.049882     1.009693     0.986561     1.016551
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.715554    -0.679700    -0.698483    -0.686328
50%      -0.048511     0.013910    -0.050685     0.008196
75%       0.610809     0.706482     0.662405     0.688171
max       3.000000     3.000000     3.000000     2.835191

np.sign(data)会根据值的正负号来得到1或-1：

In [131]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1  1.0 -1.0 -1.0 -1.0
2 -1.0 -1.0  1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4 -1.0  1.0 -1.0  1.0

排列（随机排序）一个series或DataFrame中的row，用numpy.random.permutation函数很容易就能做到。调用permutation的时候设定好你想要进行排列的axis，会产生一个整数数组表示新的顺序：

In [132]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [133]:
sampler = np.random.permutation(5)
sampler

array([0, 2, 3, 4, 1])

这个数组能被用在基于iloc上的indexing或take函数：

In [134]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7

为了选中一个随机的子集，而且没有代替功能(既不影响原来的值，返回一个新的series或DataFrame)，可以用sample方法：

In [135]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3

如果想要生成的样本带有替代功能(即允许重复)，给sample中设定replace=True：

In [136]:
choices = pd.Series([5, 7, -1, 6, 4])

draws = choices.sample(n=10, replace=True)

draws

2   -1
1    7
2   -1
0    5
3    6
1    7
4    4
1    7
3    6
1    7
dtype: int64

Dummy Variables：虚拟变量，又称虚设变量、名义变量或哑变量,用以反映质的属性的一个人工变量,是量化了的自变量,通常取值为0或1。

另一种在统计模型上的转换或机器学习应用是把一个categorical variable(类别变量)变为一个dummy or indicator matrix（虚拟或指示器矩阵）。如果DataFrame中的一列有k个不同的值，我们可以用一个矩阵或DataFrame用k列来表示，1或0。pandas有一个get_dummies函数实现这个工作，当然，你自己设计一个其实也不难。这里举个例子：

In [137]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [138]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

在一些情况里，如果我们想要给column加一个prefix， 可以用data.get_dummies里的prefix参数来实现：

In [139]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [140]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## Combining and Merging Datasets（合并数据集）

merge或join操作，能通过一个或多个key，把不同的数据集的行连接在一起。这种操作主要集中于关系型数据库。pandas中的merge函数是这种操作的主要切入点：

In [141]:
import pandas as pd
import numpy as np

In [142]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})

df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [143]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})
df2

   data2 key
0      0   a
1      1   b
2      2   d

这个例子是many-to-one join（多个变为一个的连接）；在df1中有标签为a和b的行，而df2中的key列，每一行只有对应的一个值。调用merge我们可以得到：

In [144]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

这里我们并没有指定按哪一列来连接。如果我们没有指定，merge会用两个对象中都存在的列名作为key（键）。当然，最好还是清楚指定比较好：

In [145]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

如果每一个对象中的列名不一会，我们可以分别指定：

In [146]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 
                             'data1': range(7)})

df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 
                             'data2': range(3)})

In [147]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

我们可能注意到，在结果中并没有c和d。因为merge默认是inner join(内连接)，结果中的key是交集的结果，或者在两个表格中都有的集合。其他一些可选项，比如left, right, outer。outer join（外连接）取key的合集，其实就是left join和right join同时应用的效果：

In [148]:
pd.merge(df1, df2, how='outer')

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

many-to-many(多对多)连接也被定义好了，不过可能不是那么直观。

In [149]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 
                    'data1': range(6)})

df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [150]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'], 
                    'data2': range(5)})
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [151]:
pd.merge(df1, df2, on='key', how='left')

    data1 key  data2
0       0   b    1.0
1       0   b    3.0
2       1   b    1.0
3       1   b    3.0
4       2   a    0.0
..    ...  ..    ...
6       3   c    NaN
7       4   a    0.0
8       4   a    2.0
9       5   b    1.0
10      5   b    3.0

[11 rows x 3 columns]

many-to-many join是对行进行笛卡尔集运算。（两个集合X和Y的笛卡儿积（Cartesian product），又称直积，在集合论中表示为X × Y，是所有可能的有序对组成的集合。比如1到13是一个集合，四种花色是一个集合，二者的笛卡尔积就有52个元素）。这里在左侧的DataFrame中有三行含b，右边的DataFrame则有两行含b，于是结果是有六行含b。这个join方法只会让不相同的key值出现在最后的结果里：

In [152]:
pd.merge(df1, df2, how='inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

用多个key来连接的话，用一个含有多个列名的list来指定：

In [153]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'], 
                     'key2': ['one', 'two', 'one'], 
                     'lval': [1, 2, 3]})

right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'], 
                      'key2': ['one', 'one', 'one', 'two'], 
                      'rval': [4, 5, 6, 7]})

In [154]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

哪一种key组合会出现在结果里取决于merge方法的选择，可以把多个key当做一个tuple组成的单一key（尽管实际上并不是这样）。

注意：当我们讲列和列进行连接时，DataFrame中的index对象会被丢弃。

最后一个问题是在做merge操作的时候，如何处理重叠的列名。当我们想要手动去解决重叠问题时（参考重命名axis labels的部分），merge有一个suffixes选项，能让我们指定字符串，添加重叠的列名到左、右DataFrame：

In [155]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [156]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

在一些情况下，用于归并的key（键），可能是DataFrame中的index。这种情况下，可以使用left_index=True 或 right_index=True来指明，哪一个index被用来作为归并键：

In [157]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 
                      'value': range(6)})

left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [158]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
right1

   group_val
a        3.5
b        7.0

In [159]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

merge的默认方法是用key的交集，我们也可以设定用合集，即outer join：

In [160]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

对于那些有多层级索引的数据，就更复杂了。index上的merge默认会是multiple-key merge(复数键归并)：

In [161]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
                               'Nevada', 'Nevada'], 
                      'key2': [2000, 2001, 2002, 2001, 2002], 
                      'data': np.arange(5.)})
lefth

   data    key1  key2
0   0.0    Ohio  2000
1   1.0    Ohio  2001
2   2.0    Ohio  2002
3   3.0  Nevada  2001
4   4.0  Nevada  2002

In [162]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 
                              'Ohio', 'Ohio'], 
                             [2001, 2000, 2000, 2000, 2001, 2002]], 
                      columns=['event1', 'event2'])
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

在这个例子里，我们必须指明将多列归并作为一个list（注意处理重复index的方法是令how='outer'）：

In [163]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], 
         right_index=True)

   data    key1  key2  event1  event2
0   0.0    Ohio  2000       4       5
0   0.0    Ohio  2000       6       7
1   1.0    Ohio  2001       8       9
2   2.0    Ohio  2002      10      11
3   3.0  Nevada  2001       0       1

In [164]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True, how='outer')

   data    key1  key2  event1  event2
0   0.0    Ohio  2000     4.0     5.0
0   0.0    Ohio  2000     6.0     7.0
1   1.0    Ohio  2001     8.0     9.0
2   2.0    Ohio  2002    10.0    11.0
3   3.0  Nevada  2001     0.0     1.0
4   4.0  Nevada  2002     NaN     NaN
4   NaN  Nevada  2000     2.0     3.0

同时使用两个对象里的index来归并也是可能的：

In [165]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], 
                     index=['a', 'c', 'e'], 
                     columns=['Ohio', 'Nevada'])

left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [166]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]], 
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [167]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

DataFrame有一个很便利的join实例，可以直接用index来连接。这个也可以用于与其他DataFrame进行连接，要有一样的index但不能有重叠的列：

In [168]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

由于一些历史原因，在早期的pandas版本中，DataFrame的join方法是在连接键上做left join（左连接），这样会保留左侧Dataframe的行索引。这也支持把传入的dataframe的index与被调用的DataFrame的column连接在一起：

In [169]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

最后，对于简单的index-on-index连接，可以直接给join传入一个DataFrame。（作为备选，也可以使用最普遍的concat函数，这个在下一节会做介绍）：

In [170]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]], 
                       index=['a', 'c', 'e', 'f'], 
                       columns=['New York', 'Oregon'])
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [171]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [172]:
left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

另一种结合方式被称为可互换的，比如concatenation, binding, or stacking(串联，绑定，堆叠)。Numpy中的concatenate函数可以作用于numpy 数组：

In [173]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [174]:
np.concatenate([arr, arr], axis=1)

array([[  0.,   1.,   2.,   3.,   0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.,   4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.,   8.,   9.,  10.,  11.]])

而在pandas的对象中，比如Series和DataFrame，labeled axes（便签化的轴）能让我们做更泛化的数组串联操作。不过我们可能会有下面一些疑问：

如果一个对象在其他轴上的index不同，我们应不应该在这些轴上把不同的元素合并起来，或者只用交集?

经过串联操作后，连接的部分在输出对象里应不应该是可被识别的？

concatenation axis（串联轴）含有的数据需要被保留吗？在很多情况下，DataFrame中一些用整数做的label（标签）其实最好在串联后被删除。

pandas中的concat函数能解决上面这些问题。这里会给出几个例子来说明。假设我们有三个Series，他们指明没有index overlap(索引重叠)：

In [175]:
s1 = pd.Series([0, 1], index=['a', 'b'])

s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

s3 = pd.Series([5, 6], index=['f', 'g'])

调用concat，把上面的series放在一个list里，结果会把值和索引都整合在一起：

In [176]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

默认情况下，concat中axis=0，结果会得到一个新的series。如果令axis=1，结果会变成一个DataFrame（axis=1 是列）：

In [177]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

这种情况下，不会与其他轴产生重叠，效果与join中的outer join一样。你也可以通过设定join='inner'来使用交集：

In [178]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [179]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [180]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [181]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

一个潜在的问题是串联的部分在结果里是不可辨识的。假设我们想在串联轴上创建一个多层级索引，我们需要用到keys参数：

In [182]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [183]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

如果是设定axis=1，那么keys会变为DataFrame的column header(列头)：

In [184]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [185]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'], 
                   columns=['one', 'two'])

df1

   one  two
a    0    1
b    2    3
c    4    5

In [186]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], 
                   columns=['three', 'four'])
df2

   three  four
a      5     6
c      7     8

In [187]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

如果导入一个dict而不是list，那么dict的key会被用于上面concat中的keys选项：

In [188]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

可以给创建的axis level(轴层级)用names参数来命名：

In [189]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
          names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

最后我们关心的是，在DataFrame中，行索引（row index）没有包含相关的数据：

In [190]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df1

          a         b         c         d
0  1.549608 -1.861743  0.898630 -1.061241
1  0.338491 -0.629365 -0.408725 -0.313546
2  1.734811  0.985151  1.501847 -2.728484

In [191]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
df2

          b         d         a
0  0.005519  0.489332 -1.101330
1  0.777951  1.214430  0.146313

In [192]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0  1.549608 -1.861743  0.898630 -1.061241
1  0.338491 -0.629365 -0.408725 -0.313546
2  1.734811  0.985151  1.501847 -2.728484
3 -1.101330  0.005519       NaN  0.489332
4  0.146313  0.777951       NaN  1.214430

In [193]:
pd.concat([df1, df2])

          a         b         c         d
0  1.549608 -1.861743  0.898630 -1.061241
1  0.338491 -0.629365 -0.408725 -0.313546
2  1.734811  0.985151  1.501847 -2.728484
0 -1.101330  0.005519       NaN  0.489332
1  0.146313  0.777951       NaN  1.214430

另一种数据合并方法既不属于merge，也不属于concatenation。比如两个数据集，index可能完全覆盖，或覆盖一部分。这里举个例子，考虑下numpy的where函数，可以在数组上进行类似于if-else表达式般的判断：

In [194]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], 
              index=['f', 'e', 'd', 'c', 'b', 'a'])

a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [195]:
b = pd.Series(np.arange(len(a), dtype=np.float64), 
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [196]:
np.where(pd.isnull(a), b, a)

array([ 0. ,  2.5,  2. ,  3.5,  4.5,  5. ])

Series有一个combine_first方法，效果和上面是一样，而且还会自动对齐（比如把index按字母进行排列）：

In [197]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

对于DataFrame，combine_first可以在列与列之间做到同样的事情，可以认为是用传递的对象，给调用对象中的缺失值打补丁：

In [198]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan], 
                    'b': [np.nan, 2., np.nan, 6.], 
                    'c': range(2, 18, 4)})

df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [199]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.], 
                    'b': [np.nan, 3., 4., 6., 8.]})
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [200]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

## Data Aggregation and Group Operations（数据汇总和组操作）

In [201]:
import numpy as np
import pandas as pd

In [202]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'], 
                   'data1' : np.random.randn(5), 
                   'data2' : np.random.randn(5)})
df

      data1     data2 key1 key2
0  0.348788 -0.439283    a  one
1 -0.666602 -1.023345    a  two
2  1.439921 -0.369461    b  one
3  0.090003  1.356322    b  two
4  0.246279  0.213803    a  one

假设我们想要，通过使用key1作为labels，来计算data1列的平均值。有很多方法可以做到这点，一种是访问data1，并且使用列（a series）在key1上，调用groupby。(译者：其实就是按key1来进行分组，但只保留data1这一列)：

In [203]:
grouped = df['data1'].groupby(df['key1'])

这个grouped变量是一个GroupBy object(分组对象)。实际上现在还没有进行任何计算，除了调用group key(分组键)df['key1']时产生的一些中间数据。整个方法是这样的，这个GroupBy object(分组对象)已经有了我们想要的信息，现在需要的是对于每一个group（组）进行一些操作。例如，通过调用GroupBy的mean方法，我们可以计算每个组的平均值：

In [204]:
grouped.mean()

key1
a   -0.023845
b    0.764962
Name: data1, dtype: float64

In [205]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.297533
      two    -0.666602
b     one     1.439921
      two     0.090003
Name: data1, dtype: float64

In [206]:
means.unstack()

key2       one       two
key1
a     0.297533 -0.666602
b     1.439921  0.090003

一个很有用的GroupBy方法是size，会返回一个包含group size(组大小)的series：

In [207]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

GroupBy对象支持迭代，能产生一个2-tuple（二元元组），包含组名和对应的数据块。考虑下面的情况：

In [208]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  0.348788 -0.439283    a  one
1 -0.666602 -1.023345    a  two
4  0.246279  0.213803    a  one
b
      data1     data2 key1 key2
2  1.439921 -0.369461    b  one
3  0.090003  1.356322    b  two

对于有多个key的情况，元组中的第一个元素会被作为另一个元组的key值（译者：可以理解为多个key的所有组合情况）：

In [209]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
      data1     data2 key1 key2
0  0.348788 -0.439283    a  one
4  0.246279  0.213803    a  one
('a', 'two')
      data1     data2 key1 key2
1 -0.666602 -1.023345    a  two
('b', 'one')
      data1     data2 key1 key2
2  1.439921 -0.369461    b  one
('b', 'two')
      data1     data2 key1 key2
3  0.090003  1.356322    b  two

当然，也可以对数据的一部分进行各种操作。一个便利的用法是，用一个含有数据片段（data pieces）的dict来作为单行指令(one-liner)：

In [210]:
pieces = dict(list(df.groupby('key1')))
pieces

{'a':       data1     data2 key1 key2
 0  0.348788 -0.439283    a  one
 1 -0.666602 -1.023345    a  two
 4  0.246279  0.213803    a  one, 'b':       data1     data2 key1 key2
 2  1.439921 -0.369461    b  one
 3  0.090003  1.356322    b  two}

In [211]:
pieces['b']

      data1     data2 key1 key2
2  1.439921 -0.369461    b  one
3  0.090003  1.356322    b  two

groupby默认作用于axis=0，但是我们可以指定任意的轴。例如，我们可以按dtyple来对列进行分组：

In [212]:
grouped = df.groupby(df.dtypes, axis=1)

In [213]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.348788 -0.439283
1 -0.666602 -1.023345
2  1.439921 -0.369461
3  0.090003  1.356322
4  0.246279  0.213803
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

如果一个GroupBy对象是由DataFrame创建来的，那么通过列名或一个包含列名的数组来对GroupBy对象进行索引的话，就相当于对列取子集做聚合（column subsetting for aggregation）。这句话的意思是：

df.groupby('key1')['data1'] 
df.groupby('key1')[['data2']]
上面的代码其实就是下面的语法糖（Syntactic sugar）：

df['data1'].groupby(df['key1']) 
df[['data2']].groupby(df['key1'])

尤其是对于一些很大的数据集，这种用法可以聚集一部分列。例如，在处理一个数据集的时候，想要只计算data2列的平均值，并将结果返还为一个DataFrame，我们可以这样写：

In [214]:
df

      data1     data2 key1 key2
0  0.348788 -0.439283    a  one
1 -0.666602 -1.023345    a  two
2  1.439921 -0.369461    b  one
3  0.090003  1.356322    b  two
4  0.246279  0.213803    a  one

In [215]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.112740
     two  -1.023345
b    one  -0.369461
     two   1.356322

In [216]:
df.groupby(['key1', 'key2'])['data2'].mean()

key1  key2
a     one    -0.112740
      two    -1.023345
b     one    -0.369461
      two     1.356322
Name: data2, dtype: float64

分组信息可以不是数组的形式。考虑下面的例子：

In [217]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [218]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values
people

               a         b         c         d         e
Joe    -0.251739 -0.051034 -0.971701 -1.620267  0.782785
Steve   1.231408 -0.133987 -0.881882  0.190735  0.885519
Wes    -0.891539       NaN       NaN -0.449793  0.233153
Jim    -0.085753  0.313379  0.955779  0.169421 -1.102020
Travis -0.335412 -0.263647  1.799007 -1.949208  1.080240

In [219]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f': 'orange'}

现在，我们可以通过这个dict构建一个数组，然后传递给groupby，但其实我们可以直接传入dict（可以注意到key里有一个'f'，这说明即使有，没有被用到的group key，也是ok的）：

In [220]:
by_column = people.groupby(mapping, axis=1)

In [221]:
by_column.sum()

            blue       red
Joe    -2.591969  0.480012
Steve  -0.691148  1.982941
Wes    -0.449793 -0.658386
Jim     1.125200 -0.874393
Travis -0.150201  0.481181

这种用法同样适用于series，这种情况可以看作是固定大小的映射（fixed-size mapping）：

In [222]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [223]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

比起用dict或series定义映射关系，使用python的函数是更通用的方法。任何一个作为group key的函数，在每一个index value（索引值）上都会被调用一次，函数计算的结果在返回的结果中会被用做group name。更具体一点，考虑前一个部分的DataFrame，用人的名字作为索引值。假设我们想要按照名字的长度来分组；同时我们要计算字符串的长度，使用len函数会变得非常简单：

In [224]:
people.groupby(len).sum() # len函数在每一个index（即名字）上被调用了

          a         b         c         d         e
3 -1.229032  0.262345 -0.015922 -1.900640 -0.086081
5  1.231408 -0.133987 -0.881882  0.190735  0.885519
6 -0.335412 -0.263647  1.799007 -1.949208  1.080240

混合不同的函数、数组，字典或series都不成问题，因为所有对象都会被转换为数组：

In [225]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [226]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.891539 -0.051034 -0.971701 -1.620267  0.233153
  two -0.085753  0.313379  0.955779  0.169421 -1.102020
5 one  1.231408 -0.133987 -0.881882  0.190735  0.885519
6 two -0.335412 -0.263647  1.799007 -1.949208  1.080240

最后关于多层级索引数据集(hierarchically indexed dataset)，一个很方便的用法是在聚集（aggregate）的时候，使用轴索引的层级（One of the levels of an axis index）。看下面的例子：

In [227]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'], 
                                     [1, 3, 5, 1, 3]], 
                                    names=['cty', 'tenor'])
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           labels=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [228]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.249391 -0.819291 -0.765779  1.081301  0.194019
1     -0.199835 -1.657911  1.359026 -1.003824  0.197014
2     -1.324135  0.028035 -0.543105  1.145484  0.881164
3     -4.271061 -0.467038  0.946379  0.556717  1.148756

In [229]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## Data Aggregation（数据聚合）

聚合（Aggregation）指的是一些数据转化（data transformation），这些数据转化能从数组中产生标量（scalar values）。下面的例子就是一些聚合方法，包括mean, count, min and sum。我们可能会好奇，在一个GroupBy对象上调用mean()的时候，究竟发生了什么。一些常见的聚合，比如下表，实现方法上都已经被优化过了。当然，我们可以使用的聚合方法不止这些：

我们可以使用自己设计的聚合方法，而且可以调用分组后对象上的任意方法。例如，我们可以调用quantile来计算Series或DataFrame中列的样本的百分数。

尽管quantile并不是专门为GroupBy对象设计的方法，这是一个Series方法，但仍可以被GroupBy对象使用。GroupBy会对Series进行切片（slice up），并对于切片后的每一部分调用piece.quantile(0.9)，然后把每部分的结果整合到一起：

In [230]:
import numpy as np
import pandas as pd

In [231]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'], 
                   'data1' : np.random.randn(5), 
                   'data2' : np.random.randn(5)})
df

      data1     data2 key1 key2
0  0.738348  0.471198    a  one
1 -0.674704 -0.271073    a  two
2  1.291086  0.993659    b  one
3  0.131320  0.635867    b  two
4  0.666875 -0.510149    a  one

In [232]:
grouped = df.groupby('key1')
for key, group in grouped:
    print(key)
    print(group)

a
      data1     data2 key1 key2
0  0.738348  0.471198    a  one
1 -0.674704 -0.271073    a  two
4  0.666875 -0.510149    a  one
b
      data1     data2 key1 key2
2  1.291086  0.993659    b  one
3  0.131320  0.635867    b  two

In [233]:
grouped['data1'].quantile(0.9)

key1
a    0.724053
b    1.175110
Name: data1, dtype: float64

如果想用自己设计的聚合函数，把用于聚合数组的函数传入到aggregate或agg方法即可：

In [234]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [235]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.413052  0.981347
b     1.159767  0.357793

我们发现很多方法，比如describe，也能正常使用，尽管严格的来说，这并不是聚合：

In [236]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.243507  0.795996 -0.674704 -0.003914  0.666875  0.702612
b      2.0  0.711203  0.820079  0.131320  0.421261  0.711203  1.001145

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.738348   3.0 -0.103341  0.511723 -0.510149 -0.390611 -0.271073
b     1.291086   2.0  0.814763  0.252998  0.635867  0.725315  0.814763


           75%       max
key1
a     0.100063  0.471198
b     0.904211  0.993659

## Apply：General split-apply-combine（应用：通用的分割-应用-合并）

In [237]:
import numpy as np
import pandas as pd

In [238]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                       'data2': np.random.randn(1000)})
frame.head()

      data1     data2
0  1.092972  0.118097
1  0.026339  0.507439
2  0.949888  0.021099
3  0.901134 -1.990570
4 -1.143412 -0.909590

In [239]:
quartiles = pd.cut(frame.data1, 4)
quartiles[:10]

0    (0.209, 1.699]
1    (-1.28, 0.209]
2    (0.209, 1.699]
3    (0.209, 1.699]
4    (-1.28, 0.209]
5    (0.209, 1.699]
6    (-1.28, 0.209]
7    (-1.28, 0.209]
8    (-1.28, 0.209]
9    (-1.28, 0.209]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-2.776, -1.28] < (-1.28, 0.209] < (0.209, 1.699] < (1.699, 3.189]]

cut返回的Categorical object（类别对象）能直接传入groupby。所以我们可以在data2列上计算很多统计值：

In [240]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

In [241]:
grouped = frame.data2.groupby(quartiles)

In [242]:
grouped.apply(get_stats).unstack()

                 count       max      mean       min
data1
(-2.776, -1.28]   91.0  2.149625  0.198063 -2.749254
(-1.28, 0.209]   474.0  3.335813 -0.014733 -2.877887
(0.209, 1.699]   390.0  2.922286  0.045730 -2.963238
(1.699, 3.189]    45.0  2.431596  0.055668 -2.306614

也有相同长度的桶（equal-length buckets）；想要按照样本的分位数得到相同长度的桶，用qcut。这里设定labels=False来得到分位数的数量：

In [243]:
# Return quantile numbers
grouping = pd.qcut(frame.data1, 10, labels=False)

上面的代码是把frame的data1列分为10个bin，每个bin都有相同的数量。因为一共有1000个样本，所以每个bin里有100个样本。grouping保存的是每个样本的index以及其对应的bin的编号。

In [244]:
grouped = frame.data2.groupby(grouping)

In [245]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.149625  0.174096 -2.749254
1      100.0  2.170311 -0.005556 -2.383639
2      100.0  3.335813  0.041579 -2.877887
3      100.0  2.327127 -0.115090 -2.352612
4      100.0  2.451778  0.130918 -1.981072
5      100.0  3.012711 -0.110645 -2.575465
6      100.0  2.886897  0.008649 -2.501667
7      100.0  2.904129  0.132662 -2.963238
8      100.0  2.922286  0.020833 -2.828993
9      100.0  2.650935  0.036354 -2.306614

在处理缺失值的时候，一些情况下我们会直接用dropna来把缺失值删除，但另一些情况下，我们希望用一些固定的值来代替缺失值，而fillna就是用来做这个的，例如，这里我们用平均值mean来代替缺失值NA：

In [246]:
s = pd.Series(np.random.randn(6))

In [247]:
s[::2] = np.nan

In [248]:
s

0         NaN
1   -0.178772
2         NaN
3   -0.618293
4         NaN
5    0.126869
dtype: float64

In [249]:
s.fillna(s.mean())

0   -0.223398
1   -0.178772
2   -0.223398
3   -0.618293
4   -0.223398
5    0.126869
dtype: float64

假设我们想要给每一组填充不同的值。一个方法就是对数据分组后，用apply来调用fillna，在每一个组上执行一次。这里有一些样本是把美国各州分为西部和东部：

In [250]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']

In [251]:
group_key = ['East'] * 4 + ['West'] * 4
group_key

['East', 'East', 'East', 'East', 'West', 'West', 'West', 'West']

In [252]:
data = pd.Series(np.random.randn(8), index=states)
data

Ohio          0.264281
New York      0.610566
Vermont       1.601823
Florida       0.086981
Oregon        0.630439
Nevada       -0.923786
California   -0.199961
Idaho         0.003685
dtype: float64

In [253]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio          0.264281
New York      0.610566
Vermont            NaN
Florida       0.086981
Oregon        0.630439
Nevada             NaN
California   -0.199961
Idaho              NaN
dtype: float64

In [254]:
data.groupby(group_key).mean()

East    0.320609
West    0.215239
dtype: float64

我们可以用每个组的平均值来填充NA：

In [255]:
fill_mean = lambda g: g.fillna(g.mean())

In [256]:
data.groupby(group_key).apply(fill_mean)

Ohio          0.264281
New York      0.610566
Vermont       0.320609
Florida       0.086981
Oregon        0.630439
Nevada        0.215239
California   -0.199961
Idaho         0.215239
dtype: float64

在另外一些情况下，我们可能希望提前设定好用于不同组的填充值。因为group有一个name属性，我们可以利用这个：

In [257]:
fill_values = {'East': 0.5, 'West': -1}

In [258]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [259]:
data.groupby(group_key).apply(fill_func)

Ohio          0.264281
New York      0.610566
Vermont       0.500000
Florida       0.086981
Oregon        0.630439
Nevada       -1.000000
California   -0.199961
Idaho        -1.000000
dtype: float64

假设我们想要从一个很大的数据集里随机抽出一些样本，这里我们可以在Series上用sample方法。

In [260]:
# Hearts红桃，Spades黑桃，Clubs梅花，Diamonds方片
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)

这样我们就得到了一个长度为52的Series，索引（index）部分是牌的名字，对应的值为牌的点数，这里的点数是按Blackjack（二十一点）的游戏规则来设定的。

In [261]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
       ..
9H      9
10H    10
JH     10
KH     10
QH     10
Length: 13, dtype: int64

现在，就像我们上面说的，随机从牌组中抽出5张牌：

In [262]:
def draw(deck, n=5):
    return deck.sample(n)

In [263]:
draw(deck)

JD    10
6S     6
3H     3
7C     7
3S     3
dtype: int64

假设我们想要从每副花色中随机抽取两张，花色是每张牌名字的最后一个字符（即H, S, C, D），我们可以根据花色分组，然后使用apply：

In [264]:
get_suit = lambda card: card[-1] # last letter is suit

In [265]:
deck.groupby(get_suit).apply(draw, n=2)

C  6C     6
   7C     7
D  QD    10
   3D     3
H  8H     8
   AH     1
S  5S     5
   9S     9
dtype: int64

In [266]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

5C      5
4C      4
10D    10
QD     10
AH      1
6H      6
4S      4
JS     10
dtype: int64

在groupby的split-apply-combine机制下，DataFrame的两列或两个Series，计算组加权平均（Group Weighted Average）是可能的。这里举个例子，下面的数据集包含组键，值，以及权重：

In [267]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})
df

  category      data   weights
0        a -1.164123  0.365170
1        a  0.011710  0.070411
2        a  1.750088  0.302971
3        a  1.003940  0.207086
4        b  1.713605  0.168038
5        b -0.859726  0.785891
6        b  1.195910  0.456122
7        b  0.293966  0.944496

In [268]:
grouped = df.groupby('category')

In [269]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [270]:
grouped.apply(get_wavg)

category
a    0.331892
b    0.184932
dtype: float64

## Pivot Tables and Cross-Tabulation（数据透视表和交叉表）

Pivot Tables（数据透视表）是一种常见的数据汇总工具，常见与各种spreadsheet programs（电子表格程序，比如Excel）和一些数据分析软件。它能按一个或多个keys来把数据聚合为表格，能沿着行或列，根据组键来整理数据。

数据透视表可以用pandas的groupby来制作，这个本节会进行介绍，除此之外还会有介绍如何利用多层级索引来进行reshape（更改形状）操作。DataFrame有一个pivot_table方法，另外还有一个pandas.pivot_table函数。为了有一个更方便的groupby借口，pivot_table能添加partial totals（部分合计）,也被称作margins(边界)。

cross-tabulation（交叉表，简写为crosstab），是数据透视表的一个特殊形式，只计算组频率（group frequencies）。

In [271]:
data = pd.DataFrame({'Sample': np.arange(1, 11),
        'Nationality': ['USA', 'Japan', 'USA', 'Japan', 'Japan', 'Japan', 'USA', 'USA', 'Japan', 'USA'],
        'Handedness': ['Right-handed', 'Left-handed', 'Right-handed', 'Right-handed', 'Left-handed', 'Right-handed', 'Right-handed', 'Left-handed', 'Right-handed', 'Right-handed']})
data

     Handedness Nationality  Sample
0  Right-handed         USA       1
1   Left-handed       Japan       2
2  Right-handed         USA       3
3  Right-handed       Japan       4
4   Left-handed       Japan       5
5  Right-handed       Japan       6
6  Right-handed         USA       7
7   Left-handed         USA       8
8  Right-handed       Japan       9
9  Right-handed         USA      10

作为调查分析（survey analysis）的一部分，我们想要按国家和惯用手来进行汇总。我们可以使用pivot_table来做到这点，不过pandas.crosstab函数会更方便一些：

In [272]:
pd.crosstab(data.Nationality, data.Handedness, margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

## Categorical Data（类别数据）

In [273]:
import numpy as np
import pandas as pd

In [274]:
values = pd.Series(['apple', 'orange', 'apple', 'apple'] * 2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [275]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [276]:
pd.value_counts(values)

apple     6
orange    2
dtype: int64

对于不同的类型数据值，一个更好的方法是用维度表（dimension table）来表示，然后用整数键（integer keys）来指代维度表：

In [277]:
values = pd.Series([0, 1, 0, 0] * 2)
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [278]:
dim = pd.Series(['apple', 'orange'])
dim

0     apple
1    orange
dtype: object

In [279]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

这种用整数表示的方法叫做类别（categorical）或字典编码（dictionary-encoded）表示法。表示不同类别值的数组，被称作类别，字典，或层级。本书中我们将使用类别（categorical and categories）来称呼。表示类别的整数值被叫做，类别编码（category code），或编码（code）。

In [280]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2

In [281]:
N = len(fruits)

In [282]:
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': np.random.randint(3, 15, size=N),
                   'weight': np.random.uniform(0, 4, size=N)},
                  columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple      7  0.504706
1          1  orange      5  2.941035
2          2   apple      8  0.883885
3          3   apple      5  1.070133
4          4   apple     11  3.094263
5          5  orange      7  3.133977
6          6   apple     14  0.108885
7          7   apple      7  0.325322

In [283]:
df['fruit']

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: object

In [284]:
fruits_cat = df['fruit'].astype('category')
fruits_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): [apple, orange]

In [285]:
c = fruits_cat.values
type(c)

pandas.core.categorical.Categorical

In [286]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [287]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [288]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])
my_categories

[foo, bar, baz, foo, bar]
Categories (3, object): [bar, baz, foo]

In [289]:
categories = ['foo', 'bar', 'baz']

In [290]:
codes = [0, 1, 2, 0, 0, 1]

In [291]:
my_cats_2 = pd.Categorical.from_codes(codes, categories)
my_cats_2

[foo, bar, baz, foo, foo, bar]
Categories (3, object): [foo, bar, baz]

In [292]:
ordered_cat = pd.Categorical.from_codes(codes, categories, 
                                        ordered=True)
ordered_cat

[foo, bar, baz, foo, foo, bar]
Categories (3, object): [foo < bar < baz]

In [293]:
my_cats_2.as_ordered()

[foo, bar, baz, foo, foo, bar]
Categories (3, object): [foo < bar < baz]

使用categorical能让效果提高。如果一个DataFrame的列是categorical类型，使用的时候会减少很多内存的使用。

In [294]:
N = 10000000
draws = pd.Series(np.random.randn(N))
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [295]:
categories = labels.astype('category')

可以看到labels会比categories使用更多的内存：

In [296]:
labels.memory_usage()

80000080

In [297]:
categories.memory_usage()

10000272

当然，转换成category也是要消耗计算的，不过这种消耗是一次性的：

In [298]:
%time _ = labels.astype('category')

CPU times: user 356 ms, sys: 54.8 ms, total: 411 ms
Wall time: 411 ms

在categories上使用groupby会非常快，因为用的是基于整数的编码，而不是由字符串组成的数组。

In [299]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)

In [300]:
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): [a, b, c, d]

属性cat可以访问categorical方法：

In [301]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [302]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

假设我们知道实际的类别超过了当前观测到的四个类别，那么我们可以使用set_categories方法来扩展：

In [303]:
actual_categories = ['a', 'b', 'c', 'd', 'e']
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): [a, b, c, d, e]

数据本身似乎没有改变，不过在对其进行操作的时候会反应出来。例如，value_counts：

In [304]:
cat_s.value_counts()

d    2
c    2
b    2
a    2
dtype: int64

In [305]:
cat_s2.value_counts()

d    2
c    2
b    2
a    2
e    0
dtype: int64

在大型数据集，categoricals经常用来作为省内存和提高效果的工具。在对一个很大的DataFrame或Series进行过滤后，很多类型可能不会出现在数据中。我们用remove_unused_categories方法来除去没有观测到的类别：

In [306]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): [a, b, c, d]

In [307]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): [a, b]

在使用机器学习的一些工具时，经常要转变类型数据为哑变量（dummy variables ），也被称作是独热编码（one-hot encoding）。即在DataFrame中，给一列中不同的类别创建不同的列，用1表示出现，用0表示未出现。

In [308]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [309]:
pd.get_dummies(cat_s)

   a  b  c  d
0  1  0  0  0
1  0  1  0  0
2  0  0  1  0
3  0  0  0  1
4  1  0  0  0
5  0  1  0  0
6  0  0  1  0
7  0  0  0  1